# Descriptive Statistics

In [3]:
import numpy as np
import pandas as pd

In [4]:
data = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}
data

{'Name': 0        Tom
 1      James
 2      Ricky
 3        Vin
 4      Steve
 5      Smith
 6       Jack
 7        Lee
 8      David
 9     Gasper
 10    Betina
 11    Andres
 dtype: object,
 'Age': 0     25
 1     26
 2     25
 3     23
 4     30
 5     29
 6     23
 7     34
 8     40
 9     30
 10    51
 11    46
 dtype: int64,
 'Rating': 0     4.23
 1     3.24
 2     3.98
 3     2.56
 4     3.20
 5     4.60
 6     3.80
 7     3.78
 8     2.98
 9     4.80
 10    4.10
 11    3.65
 dtype: float64}

In [5]:
df = pd.DataFrame(data)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

### SUM

In [11]:
df.sum()

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [33]:
df['Rating'].sum()

44.919999999999995

In [35]:
df[['Age','Rating']].sum()

Age       382.00
Rating     44.92
dtype: float64

In [21]:
df.sum(1)

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

#### MEAN

In [22]:
df.mean()

Age       31.833333
Rating     3.743333
dtype: float64

#### STANDARD DEVIATION [std]

In [23]:
df.std()

Age       9.232682
Rating    0.661628
dtype: float64

#### COUNT

In [24]:
df.count()

Name      12
Age       12
Rating    12
dtype: int64

#### MEDIAN

In [25]:
df.median()

Age       29.50
Rating     3.79
dtype: float64

#### MODE

In [26]:
df.mode()

      Name   Age  Rating
0   Andres  23.0    2.56
1   Betina  25.0    2.98
2    David  30.0    3.20
3   Gasper   NaN    3.24
4     Jack   NaN    3.65
5    James   NaN    3.78
6      Lee   NaN    3.80
7    Ricky   NaN    3.98
8    Smith   NaN    4.10
9    Steve   NaN    4.23
10     Tom   NaN    4.60
11     Vin   NaN    4.80

In [27]:
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

#### MAX

In [28]:
df.max()

Name      Vin
Age        51
Rating    4.8
dtype: object

#### ABSLUTE VALUE [abs]

In [32]:
df['Age'].abs()

0     25
1     26
2     25
3     23
4     30
5     29
6     23
7     34
8     40
9     30
10    51
11    46
Name: Age, dtype: int64

#### PRODUCT VALUES

In [36]:
df.product()

Age       7.158408e+17
Rating    6.320128e+06
dtype: float64

#### CUMULATIVE SUM

In [38]:
df[['Age','Rating']].cumsum()

    Age  Rating
0    25    4.23
1    51    7.47
2    76   11.45
3    99   14.01
4   129   17.21
5   158   21.81
6   181   25.61
7   215   29.39
8   255   32.37
9   285   37.17
10  336   41.27
11  382   44.92

#### CULMULATIVE PRODUCT

In [39]:
df[['Age','Rating']].cumprod()

                   Age        Rating
0                   25  4.230000e+00
1                  650  1.370520e+01
2                16250  5.454670e+01
3               373750  1.396395e+02
4             11212500  4.468465e+02
5            325162500  2.055494e+03
6           7478737500  7.810877e+03
7         254277075000  2.952512e+04
8       10171083000000  8.798485e+04
9      305132490000000  4.223273e+05
10   15561756990000000  1.731542e+06
11  715840821540000000  6.320128e+06

## SUMMARIZING DATA

In [40]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [41]:
df.describe(include=['object'])

          Name
count       12
unique      12
top     Andres
freq         1

In [50]:
df.describe(include=['number'])

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000